{
    "_commit_hash": null,
    "_name_or_path": "",
    "architectures": [
        "Eagle2ChatModel"
    ],
    "auto_map": {
        "AutoConfig": "configuration_eagle_chat.Eagle2ChatConfig",
        "AutoModel": "modeling_eagle_chat.Eagle2ChatModel",
        "AutoModelForCausalLM": "modeling_eagle_chat.Eagle2ChatModel"
    },
    "downsample_ratio": 0.5,
    "dynamic_image_size": true,
    "efficient_loss": true,
    "force_image_size": 448,
    "keep_aspect_ratio": false,
    "llm_config": {
        "_name_or_path": "./pretrained/Qwen2_5-0_5B-Instruct",
        "add_cross_attention": false,
        "architectures": [
            "Qwen2ForCausalLM"
        ],
        "attention_dropout": 0.0,
        "attn_implementation": "flash_attention_2",
        "auto_map": {
            "AutoConfig": "configuration_qwen2.Qwen2Config",
            "AutoModel": "modeling_qwen2.Qwen2Model",
            "AutoModelForCausalLM": "modeling_qwen2.Qwen2ForCausalLM"
        },
        "bad_words_ids": null,
        "begin_suppress_tokens": null,
        "bos_token_id": 151643,
        "chunk_size_feed_forward": 0,
        "cross_attention_hidden_size": null,
        "decoder_start_token_id": null,
        "diversity_penalty": 0.0,
        "do_sample": false,
        "early_stopping": false,
        "encoder_no_repeat_ngram_size": 0,
        "eos_token_id": 151645,
        "exponential_decay_length_penalty": null,
        "finetuning_task": null,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "hidden_act": "silu",
        "hidden_size": 896,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "initializer_range": 0.02,
        "intermediate_size": 4864,
        "is_decoder": false,
        "is_encoder_decoder": false,
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "length_penalty": 1.0,
        "max_length": 20,
        "max_position_embeddings": 32768,
        "max_window_layers": 21,
        "min_length": 0,
        "model_type": "qwen2",
        "no_repeat_ngram_size": 0,
        "num_attention_heads": 14,
        "num_beam_groups": 1,
        "num_beams": 1,
        "num_hidden_layers": 24,
        "num_key_value_heads": 2,
        "num_return_sequences": 1,
        "output_attentions": false,
        "output_hidden_states": false,
        "output_scores": false,
        "pad_token_id": null,
        "prefix": null,
        "problem_type": null,
        "pruned_heads": {},
        "remove_invalid_values": false,
        "repetition_penalty": 1.0,
        "return_dict": true,
        "return_dict_in_generate": false,
        "rms_norm_eps": 1e-06,
        "rope_theta": 1000000.0,
        "sep_token_id": null,
        "sliding_window": 32768,
        "suppress_tokens": null,
        "task_specific_params": null,
        "temperature": 1.0,
        "tf_legacy_loss": false,
        "tie_encoder_decoder": false,
        "tie_word_embeddings": true,
        "tokenizer_class": null,
        "top_k": 50,
        "top_p": 1.0,
        "torch_dtype": "bfloat16",
        "torchscript": false,
        "transformers_version": "4.37.2",
        "typical_p": 1.0,
        "use_bfloat16": false,
        "use_cache": false,
        "use_sliding_window": false,
        "vocab_size": 151674
    },
    "loss_version": "v4",
    "max_dynamic_patch": 12,
    "min_dynamic_patch": 1,
    "mlp_checkpoint": true,
    "model_type": "eagle_chat",
    "pad2square": false,
    "pre_feature_reduction": false,
    "ps_version": "v2",
    "select_layer": -1,
    "template": "qwen2-chat",
    "torch_dtype": "bfloat16",
    "transformers_version": null,
    "use_backbone_lora": 0,
    "use_llm_lora": 0,
    "use_thumbnail": true,
    "vision_config": {
        "_name_or_path": "",
        "add_cross_attention": false,
        "architectures": [
            "SiglipVisionModel"
        ],
        "attention_dropout": 0.0,
        "auto_map": {
            "AutoConfig": "configuration_siglip.SiglipVisionConfig",
            "AutoModel": "modeling_siglip.SiglipVisionModel"
        },
        "bad_words_ids": null,
        "begin_suppress_tokens": null,
        "bos_token_id": null,
        "chunk_size_feed_forward": 0,
        "cross_attention_hidden_size": null,
        "decoder_start_token_id": null,
        "diversity_penalty": 0.0,
        "do_sample": false,
        "drop_path_rate": 0.1,
        "early_stopping": false,
        "encoder_no_repeat_ngram_size": 0,
        "eos_token_id": null,
        "exponential_decay_length_penalty": null,
        "finetuning_task": null,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "hidden_act": "gelu_pytorch_tanh",
        "hidden_size": 1152,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "image_size": 448,
        "intermediate_size": 4304,
        "is_decoder": false,
        "is_encoder_decoder": false,
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "layer_norm_eps": 1e-06,
        "length_penalty": 1.0,
        "max_length": 20,
        "min_length": 0,
        "model_type": "siglip_vision_model",
        "no_repeat_ngram_size": 0,
        "num_attention_heads": 16,
        "num_beam_groups": 1,
        "num_beams": 1,
        "num_channels": 3,
        "num_hidden_layers": 27,
        "num_image_tokens": 1024,
        "num_return_sequences": 1,
        "output_attentions": false,
        "output_hidden_states": false,
        "output_scores": false,
        "pad_token_id": null,
        "patch_size": 14,
        "prefix": null,
        "problem_type": null,
        "projection_dim": 2048,
        "projector_hidden_act": "gelu_fast",
        "pruned_heads": {},
        "remove_invalid_values": false,
        "repetition_penalty": 1.0,
        "return_dict": true,
        "return_dict_in_generate": false,
        "sep_token_id": null,
        "suppress_tokens": null,
        "task_specific_params": null,
        "temperature": 1.0,
        "tf_legacy_loss": false,
        "tie_encoder_decoder": false,
        "tie_word_embeddings": true,
        "tokenizer_class": null,
        "top_k": 50,
        "top_p": 1.0,
        "torch_dtype": "bfloat16",
        "torchscript": false,
        "transformers_version": "4.37.2",
        "typical_p": 1.0,
        "use_bfloat16": false,
        "vision_use_head": false,
        "_attn_implementation": "flash_attention_2"
    }
}